CHECKS_FOR_REWARD = """
———————————————
🏆 До [приза](https://t.me/testboooooooooo/96) осталось еще %s уникальные проверки. 
Ты еще можешь успеть!
"""

CHECKS_FOR_REWARD_2 = """
🏆 Вау! до [приза](https://t.me/testboooooooooo/96) осталось еще 2️⃣ уникальные проверки. 
Ты еще можешь успеть! Поднажми..
"""

CHECKS_FOR_REWARD_1 = """
🏆 Ого! до [приза](https://t.me/testboooooooooo/96) осталась еще 1️⃣ уникальная проверка. 
Ты еще можешь успеть! Жми…
"""

NO_CHECKS_LEFT = """
🏆 Молодец. Ты выполнил все условия для приза. Награду получит первый и последний участник. 
Вдруг это ты? Узнаешь совсем скоро. Результаты будут в нашем [тг](https://t.me/bo_app)
"""


K_0_75 = """
😞Не переживай, в b0 уже есть %s соулмейтов для тебя с коэффициентом выше 75%%.
Подписывайся на [наш тг канал](https://t.me/bo_app), чтобы узнать первым дату выхода приложения. 

📱[Что такое приложение b0?](https://gband.app/)

🤔[Почему этим данным стоит доверять?](https://telegra.ph/Mesto-gde-tebya-cenyat-po-nastoyashchemu-04-27)
"""


K_75_100 = """
🎉Здорово, в b0 ещё %s людей, с которыми ты построишь такие же классные отношения. 

Подписывайся на [наш тг канал](https://t.me/bo_app) и сообщи о своем результате через опрос. 

Этот коэффициент соулмейта очень редкий. Создатели алгоритма ищут людей с такими крепкими связями.

📱[Что такое приложение b0?](https://gband.app/)

🤔[Почему этим данным стоит доверять?](https://telegra.ph/Mesto-gde-tebya-cenyat-po-nastoyashchemu-04-27)
"""


LOGIN_NOT_FOUND_MESSAGE = "Пожалуйста, установите имя пользователя в настройках телеграм"

AUTH_SUCCESS = f"""
Отлично! 👍🏻

Дальше всё в твоих руках. Вспоминай делать глубокий вдох удивления от захватывающих знакомств!
До встречи в b0. 👋

P.S. Твой код для входа: `%s`
"""

ONBOARDING_REQUIRED = f"""
Способны ли алгоритмы и AI определить твоего соулмейта? 🦾

Мы в это не верили, пока не создали алгоритм совместимости b0. Для этой задачи ему нужно знать твои ценности, дату рождения и пол. 🔗

Следуй подсказкам бота, укажи нужную информацию, а заодно зацени кусочек нашего будущего приложения, который откроется прямо тут, в телеге. Эта магия безопасная и очень удобная.(проверено на живых людях 🤫)

Скорее жми кнопку «Поехали 🚀»
"""

SELECT_FRIEND_REQUEST = f"""
Ты на верном пути: выбери человека, чтобы узнать, насколько вы соулмейты
"""

DONT_UNDERSTAND = f"""
Я не понимаю 😢
"""

USER_NOT_FOUND = f"""
Для работы нашего алгоритма, как и в дружбе - нужны двое. ✌️  

Поделись с  другом ссылкой на [@bo_app_bot], чтобы наш <bo>мбический алгоритм смог рассчитать для вас процент совместимости 🍻
"""

BACK_TO_APP_BUTTON = """Вернуться в приложение 📲"""

SIGNUP_FINISHED_REQUIRED_BUTTON = """Поехали 🚀"""

SELECT_FRIEND_BUTTON = """Выбрать 👤"""

MAIN_MENU_BUTTON = """В главное меню 🔙"""

PRODUCTION_STATUS = """Статус разработки «bo» 🔩"""

FAMOUES_FRIEND_BUTTON = """Кто мой друг из знаменитостей 👑"""

NO_FAMOUS_FRIENDS_FOUND = """Похоже сейчас все звезды спят 😴 заходи ночью 🌃"""

K_FRIENDSHIP_EXPLANATION = """
🧠[Как работает алгоритм b0?](https://t.me/bo_app/71)

🤔[Почему данным стоит доверять b0?](https://t.me/bo_app/71) 

😭[Что делать, если результат меня расстроил?](https://t.me/bo_app/71)

👍Что делать, если результат меня порадовал?(конечно подписаться на [@bo_app])
"""

FAMOUS_FRIEND_K_RESULT = """
👀 Вот такая крепость дружбы у тебя с %s. 

Мы рекомендуем сообщить %s как-то эту новость. 
Размести эту пикчу в сторис и отметь его аккаунт. 📸 

Вдруг - это судьба?

У нас в базе еще 17 знаменитостей. Узнай, может с кем-то у тебя еще крепче связь)
"""

MAIN_MENU_TEXT = """Скорее выбирай то, зачем пришел 👇"""


PRODUCTION_STATUS_TEXT = """
🔩 Статус разработки «bo»

Готовность:

🍎IOS версия - 93 %
🤖Android версия - 82 % 
🌏Web версия - 81 %

📆Приблизительная дата релиза приложения: 

Июль 2024 года

Почему b0 - лучшее приложение для настоящих знакомств? Ответ тут 👉 [@bo_app]
"""
